---
type: FamilyLoadedIntoDocumentEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 4
tags: [revit-api, class]
---

# FamilyLoadedIntoDocumentEventArgs

`Autodesk.Revit.DB.Events.FamilyLoadedIntoDocumentEventArgs` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | FamilyName | 2015 | `public string FamilyName { get ; }` |
| Property | FamilyPath | 2015 | `public string FamilyPath { get ; }` |
| Property | NewFamilyId | 2015 | `public ElementId NewFamilyId { get ; }` |
| Property | OriginalFamilyId | 2015 | `public ElementId OriginalFamilyId { get ; }` |